balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC510A.PIC
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA7STA" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA7STA" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="STA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA7STB" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA7STB" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="STB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA7PAD" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA7PAD" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PAD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA7CNT" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA7CNT" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="DMACS0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DMACS0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XWCOL0" edc:desc="" edc:mask="0x1" edc:name="XWCOL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XWCOL1" edc:desc="" edc:mask="0x1" edc:name="XWCOL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XWCOL2" edc:desc="" edc:mask="0x1" edc:name="XWCOL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XWCOL3" edc:desc="" edc:mask="0x1" edc:name="XWCOL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XWCOL4" edc:desc="" edc:mask="0x1" edc:name="XWCOL4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XWCOL5" edc:desc="" edc:mask="0x1" edc:name="XWCOL5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XWCOL6" edc:desc="" edc:mask="0x1" edc:name="XWCOL6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XWCOL7" edc:desc="" edc:mask="0x1" edc:name="XWCOL7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL0" edc:desc="" edc:mask="0x1" edc:name="PWCOL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL1" edc:desc="" edc:mask="0x1" edc:name="PWCOL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL2" edc:desc="" edc:mask="0x1" edc:name="PWCOL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL3" edc:desc="" edc:mask="0x1" edc:name="PWCOL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL4" edc:desc="" edc:mask="0x1" edc:name="PWCOL4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL5" edc:desc="" edc:mask="0x1" edc:name="PWCOL5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL6" edc:desc="" edc:mask="0x1" edc:name="PWCOL6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWCOL7" edc:desc="" edc:mask="0x1" edc:name="PWCOL7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="XWCOL" edc:desc="" edc:mask="0xff" edc:name="XWCOL" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="PWCOL" edc:desc="" edc:mask="0xff" edc:name="PWCOL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="DMACS1" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----111100000000" edc:name="DMACS1" edc:nzwidth="0x10" edc:por="----111100000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPST0" edc:desc="" edc:mask="0x1" edc:name="PPST0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPST1" edc:desc="" edc:mask="0x1" edc:name="PPST1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPST2" edc:desc="" edc:mask="0x1" edc:name="PPST2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPST3" edc:desc="" edc:mask="0x1" edc:name="PPST3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPST4" edc:desc="" edc:mask="0x1" edc:name="PPST4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPST5" edc:desc="" edc:mask="0x1" edc:name="PPST5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPST6" edc:desc="" edc:mask="0x1" edc:name="PPST6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPST7" edc:desc="" edc:mask="0x1" edc:name="PPST7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSTCH" edc:desc="" edc:mask="0xf" edc:name="LSTCH" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="LSTCH0" edc:desc="" edc:mask="0x1" edc:name="LSTCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSTCH1" edc:desc="" edc:mask="0x1" edc:name="LSTCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSTCH2" edc:desc="" edc:mask="0x1" edc:name="LSTCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSTCH3" edc:desc="" edc:mask="0x1" edc:name="LSTCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PPST" edc:desc="" edc:mask="0xff" edc:name="PPST" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
